//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

int[] nums = new int [8];
int[] numbers = {1,6,2,8,55,98,24,3};

Console.WriteLine(numbers[0]);
Console.WriteLine(numbers[1]);
Console.WriteLine(numbers[2]);
Console.WriteLine(numbers[3]);
Console.WriteLine(numbers[4]);
Console.WriteLine(numbers[5]);
Console.WriteLine(numbers[6]);
Console.WriteLine(numbers[7]);