//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
Console.WriteLine ("Введите число: ");
int num = int.Parse(Console.ReadLine());

void SumNum (num[] args)
{
    int n_sum = int num;
    Console.WriteLine ("n_sum % 10");

    int result = SumNum(num[] args);
}
Console.WriteLine (SumNum());
